app/controllers/electives_controller.rb

  def index
    @search = Elective.search(params[:q])
---
SELECT `electives`.* FROM `electives`