app/controllers/specialties_controller.rb

SELECT `specialties`.* FROM `specialties`
---
  def index
    @search = Specialty.search(params[:q])